require "./player"
require "./computer"
require "./character"

class Map < Character
  attr_reader :max_square

  def initialize(max_square)
    @max_square = max_square
  end
  
  def activate_gimmick(character)
    case character.position
    when 1
      puts <<~text
       ---------------------------
       |     ==2マスすすむ==     |
       ---------------------------
       text
       
    when  3
      puts <<~text
       ---------------------------
       |      ==2マス戻る==      |
       ---------------------------
       text
      
    when 5
       puts <<~text
       ---------------------------
       |    ==スタートに戻る==   |
       ---------------------------
       スタートに戻りました。
       text
      
    when 7
       puts <<~text
       ---------------------------
       |     ==2マスすすむ==     |
       ---------------------------
      text
      
    when 10
       puts <<~text
       ---------------------------
       |     ==5マスすすむ==     |
       ---------------------------
      text
      
    when 14
       puts <<~text
       ---------------------------
       |      ==7マス戻る==      |
       ---------------------------
       text
      
    when 17
       puts <<~text
       ---------------------------
       |      ==3マス戻る==      |
       ---------------------------
       text
      
    when 20
       puts <<~text
       ---------------------------
       |    ==スタートに戻る==   |
       ---------------------------
       スタートに戻りました。
       text
      
    when 26
       puts <<~text
       ---------------------------
       |    ==スタートに戻る==   |
       ---------------------------
       スタートに戻りました。
       text
      
    when 28
       puts <<~text
       ---------------------------
       |     ==10マスに戻る==    |
       ---------------------------
       text
      
    when 29
       puts <<~text
       ---------------------------
       |    ==スタートに戻る==   |
       ---------------------------
       スタートに戻りました。
       text
      
    end
  end
end