class Sample

  @gimmicks = [{ square: 1,  gimmick_name: "==2マスすすむ==", position: 2 },
               { square: 3,  gimmick_name: "==2マス戻る==", position: -2 }
             ]
  if @gimmicks[:square] == 1
    puts "#{@gimmicks[0][:gimmick_name]} "
  end
end
sample = Sample.new
puts sample

def activate_gimmick(character)
  case character.position
  when 1
    puts <<~text
           ---------------------------
           |     ==2マスすすむ==     |
           ---------------------------
         text
  when 3
    puts <<~text
           ---------------------------
           |      ==2マス戻る==      |
           ---------------------------
         text
  when 5
    puts <<~text
           ---------------------------
           |    ==スタートに戻る==   |
           ---------------------------
           スタートに戻りました。
         text
  when 7
    puts <<~text
           ---------------------------
           |     ==2マスすすむ==     |
           ---------------------------
         text
  when 10
    puts <<~text
           ---------------------------
           |     ==5マスすすむ==     |
           ---------------------------
         text
  when 14
    puts <<~text
           ---------------------------
           |      ==7マス戻る==      |
           ---------------------------
         text
  when 17
    puts <<~text
           ---------------------------
           |      ==3マス戻る==      |
           ---------------------------
         text
  when 20
    puts <<~text
           ---------------------------
           |    ==スタートに戻る==   |
           ---------------------------
           スタートに戻りました。
         text
  when 26
    puts <<~text
           ---------------------------
           |    ==スタートに戻る==   |
           ---------------------------
           スタートに戻りました。
         text
  when 28
    puts <<~text
           ---------------------------
           |     ==10マスに戻る==    |
           ---------------------------
         text
  when 29
    puts <<~text
           ---------------------------
           |    ==スタートに戻る==   |
           ---------------------------
           スタートに戻りました。
         text
  else
    puts <<~text
           -------------------------------------
           |     ==何も起こりませんでした==    |
           -------------------------------------
         text
  end
end
